Revit 2027 API
DistributionSysType.IsInUse Property
 Get the value which indicates whether this distribution system is in service now.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsInUse { get; }
Public ReadOnly Property IsInUse As Boolean
	Get
public:
property bool IsInUse {
	bool get ();
}
member IsInUse : bool with get
Property Value
Boolean
See Also
Reference
DistributionSysType Class
Autodesk.Revit.DB.Electrical Namespace